vendor/github.com/dynport/gocloud/profitbricks/fixtures/get_data_center_request.xml

<?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://ws.api.profitbricks.com/" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"><env:Body><tns:getDataCenter><dataCenterId>eb394325-b2f1-418c-93e4-377697e3c597</dataCenterId></tns:getDataCenter></env:Body></env:Envelope>
